// require no arguments
"NoRootError" = "No root specified for archive.";
"ArchiveToolError" = "A problem was encountered with the \"packagearchiver\" tool.";
"MissingIdentifierError" = "No package identifier specified.";
"CPIOWriteError" = "Could not create working CPIO archive.";
"ScriptArchiverError" = "Could not create CPIO from resource extras.";
"InvalidFlatPackageSettingsError" = "A flat package must contain either a payload or scripts.";
"NegativeUIDWarning" = "PackageMaker cannot properly archive files with negative UIDs or GIDs, which include:\n\n%@\n";
"EmptyBOMError" = "No files were found to archive.";

// require one argument
"FileNotFoundError" = "File not found: \"%@\".";
"FileCreationError" = "File could not be created: \"%@\".";
"FileRemovalError" = "File could not be removed: \"%@\".";
"RootError" = "Root directory \"%@\" is not valid.";
"TempBuildError" = "Could not copy root to temp directory: \"%@\".";
"PreserveForksError" = "Could not preserve resources in root: \"%@\".";
"XMLError" = "Could not create Distribution XML file: \"%@\".";
"DuplicateIdentifierError" = "Package identifier \"%@\" used for multiple packages.";
"InvalidPkgVersionError" = "Invalid version \"%@\" (must have format \"1.2.3\").";
"InvalidPkgRefVersionError" = "Invalid version \"%@\" (must have format \"1.2.3.4.5\").";
"InvalidPlistError" = "Invalid property list file \"%@\".";
"ArchiveFileError" = "Could not archive file: \"%@\".";
"FoundSymlinkError" = "Symbolic link found: \"%@\". Will be overwritten during install.";
"BOMModifyError" = "Could not modify BOM file \"%@\".";

// require two arguments
"FileCopyError" = "File could not be copied from \"%@\" to \"%@\".";
"ArchiveGeneralError" = "Could not create archive from \"%@\" to \"%@\".";
"BOMError" = "Could not create BOM file from \"%@\" to \"%@\".";
"MissingInfoError" = "Missing %@ field for \"%@\".";